{
    "basics": {
        "name": "Giacomo Bergami",
        "label": "Lecturer (Assistant Professor) in Game Technology at Newcastle University",
        "image": "https://logDS.github.io/assets/img/Icon.jpeg",
        "email": "bergamigiacomo@gmail.com",
        "url": "jackbergus.github.io",
        "location": {
            "city": "Newcastle Upon Tyne",
            "country": "United Kingdom"
        },
        "profiles": [
            {
                "network": "X",
                "username": "gyankos",
                "url": "https://x.com/gyankos"
            }
        ]
    },
    "work": [
        {
            "name": "Freie Universität Bozen",
            "position": "Postdoctoral Researcher",
            "url": "https://www.unibz.it/it/home/position-calls/positions-for-academic-staff/4876-sistemi-di-elaborazione-delle-informazioni-prof-maggi?group=18",
            "startDate": "2021-01-01",
            "endDate": "2021-09",
            "summary": "Bridging Data Integration for Energy Efficiency with Business Process Management",
            "highlights": [
                "Business Process Management",
                "Conformance Checking",
                "Database"
            ]
        },
        {
            "name": "School of Computing, Newcastle University",
            "position": "Teaching Fellow, Lecturer (November)",
            "startDate": "2019-09",
            "endDate": "2020-08",
            "summary": "Teaching Real-Time technologies for Videogames in C++",
            "highlights": [
                "In-Silico Learning",
                "C++ Programming",
                "Game Technology"
            ]
        },
        {
            "name": "Herbert Wertheim College of Engineering, University of Florida",
            "url": "https://dsr.cise.ufl.edu/people/index.html",
            "position": "PostDoc Researcher",
            "startDate": "2018-06",
            "endDate": "2019-08",
            "summary": "Development of new technologies for data integration and resolution of intrinsic system errors. This issue was linked to artificial intelligence as the answer to textual questions of users on digital data requires the ability to interpret and deduct/infer, together with the treatment of numerical and probabilistic values.",
            "highlights": [
                "Inconsistency Metrics",
                "Java Programming",
                "C++ Programming",
                "Data Science Pipelines"
            ]
        },
        {
            "name": "Universität Leipzig",
            "url": "https://dbs.uni-leipzig.de/study/semester/ss-2017/zingst",
            "position": "Visiting PhD Student",
            "startDate": "2017-01",
            "endDate": "2017-05",
            "summary": "University of Bologna requires each PhD candidate to conduct the last year of research in a foreign research centre to develop new skills and networking. I worked on NoSQL data management (graph) with Java distributed technologies (Hadoop+Apache Flink).",
            "highlights": [
                "Graph Algorithms",
                "Distributed Computation",
                "Gradoop"
            ]
        }
    ],
    "education": [
        {
            "studyType": "PhD in Computer Science and Engineering",
            "startDate": "2014",
            "area": "Diss. Title: <i>A new Nested Graph Model for Data Integration</i>",
            "location": "Bologna, Italy",
            "institution": "University of Bologna",
            "courses": [
                "Framing the graph join   and nesting   operators in the broader context of Data Integration. Generalising such concepts in the context of a general data model and query language  "
            ],
            "endDate": "2018",
            "url": "http://amsdottorato.unibo.it/8348/"
        },
        {
            "studyType": "MSc in Computer Science",
            "startDate": "2012",
            "area": "Diss. Title: <i>Hypergraph Mining for Social Networks</i>",
            "location": "Bologna, Italy",
            "institution": "University of Bologna",
            "courses": [
                "Leveraging the Relational Algebra for Data Mining in the context of Hypergraph\nNetworks, while providing suitable use case scenarios for its applicability."
            ],
            "endDate": "2014",
            "url": "http://amslaurea.unibo.it/7106/"
        },
        {
            "studyType": "BSc in Computer Science",
            "startDate": "2009",
            "area": "Diss. Title: <i>Pjproject on Android: a clash over multiple layers</i>",
            "location": "Bologna, Italy",
            "institution": "University of Bologna",
            "courses": [
                "Porting of a SIP-communication GNU/Linux application on Android required to provide an in-depth analysis of the Android Operative System."
            ],
            "endDate": "2012",
            "url": "https://amslaurea.unibo.it/4441/"
        }
    ],
    "awards": [
        {
            "title": "Best Paper Award",
            "date": "2024-10-21",
            "awarder": "eHPWAS 2024",
            "bibref": "simbridger2",
            "summary": "Best paper award for 'Approximating Real-Time IoT Interaction through Connection Counting: A QoS Perspective'.",
            "url": "https://www.ehpwas.org/pics/114.jpeg"
        },
        {
            "title": "Best Paper Award",
            "date": "2024-08-30",
            "awarder": "IDEAS 2024",
            "bibref": "ideas2024a",
            "summary": "Best paper award for 'Predicting Dyskinetic Events through Verified Multivariate Time Series Classification'.",
            "url": "https://conferences.sigappfr.org/ideas2024/best-papers/"
        },
        {
            "title": "'Francesco Viviani' Recognition",
            "awarder": "Ferrara's Chamber of Commerce, IT",
            "date": "2009-11-07",
            "summary": "For obtaining the high school diploma with top marks and merit.",
            "url": "https://www.yumpu.com/it/document/read/36107669/riconoscimenti-francesco-viviani-camera-di-commercio-di-ferrara"
        }
    ],
    "projects": [
    {"name":"EPSRC Doctoral Training Programme studentships",
    "summary": "Ensuring one 3 and a half year PhD scholarship on formal methods for dealing with real data containing uncertainties and inconsistencies. This includes a tuition fee, a stipend, and lab equipment and consumables costs.",
    "highlights": ["Graph Query Languages", "NLP"], "startDate":"2023-09","endDate":"2026"},
        {
            "name": "National Edge AI Hub for Real Data: Edge Intelligence for Cyberdisturbances and Data Quality",
            "summary": "In coordination with the principal investigator (Prof. Rajiv Ranjan), we have £1 billion for a project shared between different UK universities, for which Newcastle has received £4 million. This project concerns the application of AI in a distributed environment and on the Edge.",
            "highlights": [
                "Smart-Cities",
                "eHealth",
                "Osmotic Simulator"
            ],
            "startDate": "2024-02-01",
            "endDate": "2029-01-31",
            "url": "https://edgeaihub.co.uk"
        }
    ],
    "certificates": [
        {
            "name": "One-Sided Communication and the MPI Shared Memory Interface — HLRS/PRACE",
            "date": "2021-12",
            "issuer": "FutureLearn",
            "url": "https://www.futurelearn.com/certificates/3fk5r9j"
        },
        {
            "name": "Functional Programming in Haskell: Supercharge Your Coding",
            "date": "2016-10",
            "issuer": "FutureLearn",
            "url": "https://www.futurelearn.com/certificates/f6fod7p"
        }
    ],
    "languages": [
        {
            "language": "English",
            "fluency": "Fluent Speaker",
            "icon": ""
        },
        {
            "language": "Italian",
            "fluency": "Native Speaker",
            "icon": ""
        },
        {
            "language": "French",
            "fluency": "A2",
            "icon": ""
        },
        {
            "language": "German",
            "fluency": "A1",
            "icon": ""
        }
    ],
    "publications": [
        {
            "name": "Towards a Generalised Semistructured Data Model and Query Language",
            "releaseDate": "2023-8",
            "url": "https://doi.org/10.1145/3609429.3609433",
            "summary": "Although current efforts are all aimed at re-defining new ways to harness old data representations, possibly with new schema features, the challenges still open provide evidence of the need for a \"diametrically opposite\" approach: in fact, all information generated in real contexts is to be understood lacking of any form of schema, where the schema associated with such data is only determined a posteriori based on either a specific application context, or from some data's facets of interest. This solution should still enable recommendation systems to manipulate the aforementioned data semantically. After providing evidence of these limitations from current literature, we propose a new Generalized Semistructured data Model that makes possible queries expressible in any data representation through a Generalised Semistructured Query Language, both relying upon script v2.0 as a MetaModel language manipulating types as terms as well as allowing structural aggregation functions.",
            "publisher": "Association for Computing Machinery"
        },
        {
            "name": "DECLAREd: A Polytime LTLf Fragment",
            "releaseDate": "2024",
            "url": "https://www.mdpi.com/2813-0405/2/2/4",
            "summary": "This paper considers a specification rewriting meachanism for a specific fragment of Linear Temporal Logic for Finite traces, DECLAREd, working through an equational logic and rewriting mechanism under customary practitioner assumptions from the Business Process Management literature. By rewriting the specification into an equivalent formula which might be easier to compute, we aim to streamline current state-of-the-art temporal artificial intelligence algorithms working on temporal logic. As this specification rewriting mechanism is ultimately also able to determine with the provided specification is a tautology (always true formula) or a formula containing a temporal contradiction, by detecting the necessity of a specific activity label to be both present and absent within a log, this implies that the proved mechanism is ultimately a SAT-solver for DECLAREd. We prove for the first time, to the best of our knowledge, that this fragment is a polytime fragment of LTLf, while all the previously-investigated fragments or extensions of such a language were in polyspace. We test these considerations over formal synthesis (Lydia), SAT-Solvers (AALTAF) and formal verification (KnoBAB) algorithms, where formal verification can be also run on top of a relational database and can be therefore expressed in terms of relational query answering. We show that all these benefit from the aforementioned assumptions, as running their tasks over a rewritten equivalent specification will improve their running times, thus motivating the pressing need of this approach for practical temporal artificial intelligence scenarios. We validate such claims by testing such algorithms over a Cybersecurity dataset.",
            "publisher": "Logics"
        },
        {
            "name": "On Efficiently Equi-Joining Graphs",
            "releaseDate": "2021",
            "url": "https://doi.org/10.1145/3472163.3472269",
            "summary": "Despite the growing popularity of techniques related to graph summarization, a general operator for joining graphs on both the vertices and the edges is still missing. Current languages such as Cypher and SPARQL express binary joins through the non-scalable and inefficient composition of multiple traversal and graph creation operations. In this paper, we propose an efficient equi-join algorithm that is able to perform vertex and path joins over a secondary memory indexed graph, also the resulting graph is serialised in secondary memory. The results show that the implementation of the proposed model outperforms solutions based on graphs, such as Neo4J and Virtuoso, and the relational model, such as PostgreSQL. Moreover, we propose two ways how edges can be combined, namely the conjunctive and disjunctive semantics, Preliminary experiments on the graph conjunctive join are also carried out with incremental updates, thus suggesting that our solution outperforms materialized views over PostgreSQL.",
            "publisher": "Association for Computing Machinery"
        }
    ],
      "volunteer": [
    {
      "organization": "PhD Progression and Completion Committee",
      "location": "School of Computing, NCL",
      "position": "Member",
      "startDate": "2021",
      "summary": "Sitting as a panel member for PhD yearly progressions and project proposals. This deals with addressing questions to the PhD students in terms of both the project plan and research directions."
    },
        {
      "organization": "Dr. Yiang Lu’s Viva",
      "location": "School of Computing, NCL",
      "position": "Internal Examiner ",
      "startDate": "2024",
      "endDate": "2024",
      "summary": "Providing a mediating position with the External Examinator for the dissertation defense of the candidate supervised by Prof. Graham Morgan."
    }
  ]
}
